Perception Algorithm

Lets us import the necessary libraries

In [57]:
import pandas as pd
import numpy as np 
from sklearn.linear_model import Perceptron
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [58]:
data = pd.read_csv('datasets/car_data.csv')
data.head()

   User ID Gender  Age  AnnualSalary  Purchased
0      385   Male   35         20000          0
1      681   Male   40         43500          0
2      353   Male   49         74000          0
3      895   Male   40        107500          1
4      661   Male   25         79000          0

feature engineering

In [59]:
data.isnull().sum()

User ID         0
Gender          0
Age             0
AnnualSalary    0
Purchased       0
dtype: int64

We have the clean data

In [60]:
data.head()

   User ID Gender  Age  AnnualSalary  Purchased
0      385   Male   35         20000          0
1      681   Male   40         43500          0
2      353   Male   49         74000          0
3      895   Male   40        107500          1
4      661   Male   25         79000          0

Now let us perform the categorical encodings

In [61]:
data['Gender'] = data['Gender'].replace({'Male':0,'Female':1})

/tmp/ipykernel_158997/658298938.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data['Gender'] = data['Gender'].replace({'Male':0,'Female':1})

In [62]:
data

     User ID  Gender  Age  AnnualSalary  Purchased
0        385       0   35         20000          0
1        681       0   40         43500          0
2        353       0   49         74000          0
3        895       0   40        107500          1
4        661       0   25         79000          0
..       ...     ...  ...           ...        ...
995      863       0   38         59000          0
996      800       1   47         23500          0
997      407       1   28        138500          1
998      299       1   48        134000          1
999      687       1   44         73500          0

[1000 rows x 5 columns]